### Pandas 101
In this notebook we will learn about Pandas, the Python data analysis tools, to manipulate and analyse data.

### 1. Installation

Pandas support Python's versions 2.7, 3.4, and 3.5.

Python will be required here. You can install it from the [source releases](https://www.python.org/downloads/) if you don't have it.

Python covers the download facility for multiple operating systems like [Windows](https://www.python.org/downloads/windows/), [UNIX](https://www.python.org/downloads/source/), [OS X](https://www.python.org/downloads/mac-osx/), and [others](https://www.python.org/download/other/).

#### 1.1 PyPI Installation

```bash
$ sudo pip install pandas
```

This will automatically download all the dependencies, but it will take some time in the process.

#### 1.2 Linux Distribution Installation

This commands will install Pandas for Python 2 from your distribution.

To install it for Python 3, you should use "*python3-pandas*" instead.

* **Ubuntu & Debian**

```bash
$ sudo apt-get install python-pandas
```

* **Fedora & OpenSuse**

```
zypper in  python-pandas
```

It will install from "Official Debian Repository" and "OpenSuse Repository" respectively.

#### 1.3 Anaconda Installation

Anaconda is a cross-platform Python distribution for scientific computing and data analytics.

It makes the installation phase easy for beginners.

You can get Anaconda from [here](https://docs.continuum.io/anaconda/install).

You can play with Pandas online at the IPython Notebook service by [Wakari](https://wakari.io/), without installing it.

We will start by importing the pandas and numpy package.

In [1]:
import pandas as pd

In [2]:
import numpy as np

### 2. Reading, Writing, and Creating data
Pandas let you use your data from multiple formats like CSV, EXCEL, JSON etc.

You can use the data file on your local system or from an external URL.

#### 2.1 Create data
You can easily convert your Python lists into a DataFrame object.

DataFrame is the most commonly used data-structure of Pandas, it's a 2-dimensional table like structure that can hold columns of multiple data-types.

In [3]:
# You can easily convert your Python lists into a DataFrame.
subjects = ['Mathematics', 'English', 'History', 'Science', 'Arts']
marks = [67, 60, 36, 61, 58]

Using the Python's **zip** function, we can merge these two **list** sequences into one.

In [4]:
marks_dataset = zip(subjects, marks)
marks_dataset

[('Mathematics', 67),
 ('English', 60),
 ('History', 36),
 ('Science', 61),
 ('Arts', 58)]

In [5]:
# Convert the new list to a DataFrame
marks_df = pd.DataFrame(marks_dataset, columns=['Subjects', 'Marks'])
marks_df

      Subjects  Marks
0  Mathematics     67
1      English     60
2      History     36
3      Science     61
4         Arts     58

The **columns** argument list represents the labels of the respective columns.

Add a new column 'Result' using **numpy.where**, set it as 'Pass' if **marks>=40** else 'Fail'.

In [6]:
marks_df['Result'] = np.where(marks_df['Marks']>=40, 'Pass', 'Fail')
marks_df

      Subjects  Marks Result
0  Mathematics     67   Pass
1      English     60   Pass
2      History     36   Fail
3      Science     61   Pass
4         Arts     58   Pass

To delete a column (say 'Result'), we can use **`marks_df.pop('Result')`**.

#### 2.2 Write data
We can write the **DataFrame** object to different file types.

In [7]:
# save the marks dataframe to a csv(comma-separated values) file in your directory
marks_df.to_csv('marks.csv', index=False)

The argument **index=False** is to prevent writing the index for each row (0...4) in file.

#### 2.3 Read data
You can read data into Pandas from different types of files.

**Here, we will be using the 'YouTube Channel Dataset'.** [https://gist.github.com/pravj/9ae9e67d10668c60545e2b858753415c]

**Some of the "Views" and "Comments" columns have missing values, represented as -1.**

It represents the YouTube channel customer reach (views and comments) for two channel named '*WorldNews*' and '*WorldWeather*'.

In [8]:
# reading csv dataset from an external URL
channels_df = pd.read_csv('http://bit.ly/1rq29Xf')

### 3. Selecting and Filtering dataframes
In this section, we will learn about selecting and filtering out parts of the dataframes, satisfying specific conditions.

In [9]:
# shows statistics about the dataset
channels_df.describe()

            Views    Comments
count  362.000000  362.000000
mean   288.229282   17.383978
std    147.604341   12.479304
min     -1.000000   -1.000000
25%    172.750000    8.000000
50%    295.500000   14.000000
75%    399.000000   26.000000
max    533.000000   54.000000

We can replace the missing data values **(-1)** with **NaN** for some statistical ease.

In [10]:
channels_df = channels_df.replace(-1, np.nan)

Select top 5 row for the dataframe. (**`tail`** function will return last 5 rows)

In [11]:
channels_df.head()

        Channel        Date Anchor  Views  Comments
0     WorldNews  2015-01-01    bob  495.0      39.0
1  WorldWeather  2015-01-01  emily  191.0      24.0
2     WorldNews  2015-01-02    bob  293.0       4.0
3  WorldWeather  2015-01-02  harry  238.0       NaN
4     WorldNews  2015-01-03  alice  509.0      13.0

Select rows only for the 'WorldNews' channel.

In [12]:
worldnews_df = channels_df[channels_df['Channel'] == 'WorldNews']

Select some sample rows from the new dataframe.

In [13]:
worldnews_df.sample(3)

       Channel        Date Anchor  Views  Comments
82   WorldNews  2015-02-11    bob  432.0       9.0
246  WorldNews  2015-05-04  alice  294.0      19.0
126  WorldNews  2015-03-05   jenn  513.0       5.0

Filter out the rows for 'WorldNews' channel having less than 100 views.

In [14]:
worldnews_less_views_df = worldnews_df[worldnews_df['Views'] < 100]

Count the days when 'WorldNews' has received less than 100 views.

In [15]:
worldnews_less_views_df.size

105

#### 3.1 Indexing

To get and set subsets of data object, Pandas supports 3 types of multi-axis indexing.

* **loc**
    * It is based on the index *labels*.
* **iloc**
    * It is based on the index *positions*, only integer values are accepted.
* **ix**
    * Generally it behaves like **loc** but falls back to **iloc** when the label is not present in the index.

In our dataset the index contains only integer values, so all these methods will work similarly.

**Note that** the DataFrame *worldnews_df* contains only even integers in the index.

In [16]:
worldnews_df.index

Int64Index([  0,   2,   4,   6,   8,  10,  12,  14,  16,  18,
            ...
            342, 344, 346, 348, 350, 352, 354, 356, 358, 360],
           dtype='int64', length=181)

##### 3.1.1 Selection By Label

In the **label based indexing**, it follows **strict inclusion**.

For example **[10:14]** will look for every value in between 10 and 14 including both.

**At least 1** labels should be present in the index, otherwise a **KerError** will be raised.

This will return the top **3** rows having index as 0, 2, and 4; Because it looks at the labels.

In [17]:
worldnews_df.loc[0:4]

     Channel        Date Anchor  Views  Comments
0  WorldNews  2015-01-01    bob  495.0      39.0
2  WorldNews  2015-01-02    bob  293.0       4.0
4  WorldNews  2015-01-03  alice  509.0      13.0

##### Selection By Position

In the **integer based indexing**, it follows **0-based** slicing similar to Python lists that you are used to.

Where the starting bound is included but the upper bound is excluded.

Using a non-integer, even a valid label will raise a **IndexError**.

Hence, this will return the top **4** rows, Because it looks at the positions.

In [18]:
worldnews_df.iloc[0:4]

     Channel        Date Anchor  Views  Comments
0  WorldNews  2015-01-01    bob  495.0      39.0
2  WorldNews  2015-01-02    bob  293.0       4.0
4  WorldNews  2015-01-03  alice  509.0      13.0
6  WorldNews  2015-01-04  alice  490.0      54.0

This will work like **loc** because the index contains integer values.

In [19]:
worldnews_df.ix[0:4]

     Channel        Date Anchor  Views  Comments
0  WorldNews  2015-01-01    bob  495.0      39.0
2  WorldNews  2015-01-02    bob  293.0       4.0
4  WorldNews  2015-01-03  alice  509.0      13.0

### 4. Grouping, Aggregating, and Pivoting data

#### 4.1 Grouping
We can group (combine) the dataset based on certain parameters.

For example, here we are grouping the 'WorldNews' dataset based on their 'Anchor' columns.

In [20]:
worldnews_anchors_group = worldnews_df.groupby(worldnews_df['Anchor'])

This will return a **DataFrameGroupBy** object.

In [21]:
type(worldnews_anchors_group)

pandas.core.groupby.DataFrameGroupBy

#### 4.2 Aggregating
Aggregating the resultant group will count the respective 'Views' and 'Columns' for each anchor.

In [22]:
worldnews_anchors_group.aggregate(np.sum)

          Views  Comments
Anchor
alice   17498.0    1227.0
bob     17754.0     821.0
jenn    16946.0     888.0

#### 4.3 Pivoting
Using the pivot function, we can generate a new table from the original one.

It takes three arguments, that decides the **index**, **columns**, and **cell values** of the new table we want.

Consider this sample table for example.

In [23]:
worldnews_df.sample(10)

       Channel        Date Anchor  Views  Comments
282  WorldNews  2015-05-22   jenn  200.0       NaN
186  WorldNews  2015-04-04  alice  114.0      20.0
20   WorldNews  2015-01-11  alice  480.0      24.0
242  WorldNews  2015-05-02  alice  100.0      26.0
136  WorldNews  2015-03-10  alice  240.0      24.0
10   WorldNews  2015-01-06   jenn  399.0      17.0
44   WorldNews  2015-01-23   jenn   72.0      25.0
286  WorldNews  2015-05-24  alice  394.0       NaN
268  WorldNews  2015-05-15  alice  400.0      31.0
328  WorldNews  2015-06-14  alice  378.0      36.0

We can try reshaping this table to find out how many 'Views' each anchor has received.

So we will create a new table whose 'index' is 'Date', 'columns' will be different values of 'Anchor column'.

The cell values will be the respective value of the 'Views' column.

In [24]:
worldnews_pivoted_df = worldnews_df.pivot(index='Date', columns='Anchor', values='Views')
worldnews_pivoted_df.sample(10)

Anchor      alice    bob   jenn
Date
2015-06-04    NaN  113.0    NaN
2015-04-07  304.0    NaN    NaN
2015-06-23    NaN  406.0    NaN
2015-04-20    NaN  281.0    NaN
2015-02-09    NaN  509.0    NaN
2015-02-26    NaN    NaN   91.0
2015-03-02  115.0    NaN    NaN
2015-02-24    NaN  284.0    NaN
2015-05-31    NaN    NaN  311.0
2015-02-28    NaN    NaN  505.0

This is our derived table, you can see how many views different anchors have received.

Similarly you can reshape your tables according to your usecase.

### 5. Interpolation

Sometimes your dataset has missing values in it. It may have caused by the equipment fault, human error or many other ways.

Pandas provide the **interpolate** function to insert data between fixed points.

It uses different methods to regularize the missing values, by default it uses **linear interpolation** for the same.

We can count the absent values (**NaN**) using the **isnull** method.

In [25]:
worldnews_df.isnull().sum()

Channel     0
Date        0
Anchor      0
Views       7
Comments    7
dtype: int64

Now let's interpolate the Series object.

In [26]:
worldnews_interpolated_df = worldnews_df.interpolate()

After interpolation, we can see that there are no more **NaN** values.

In [27]:
worldnews_interpolated_df.isnull().sum()

Channel     0
Date        0
Anchor      0
Views       0
Comments    0
dtype: int64

### 6. Joining data

Pandas provides multiple methods to easily combine DataFrame and Series objects, like we see in SQL's join operations.

Consider these two small DataFrames.

In [28]:
Adf = worldnews_df.iloc[3:8]
Bdf = channels_df[channels_df['Channel'] == 'WorldWeather'].iloc[5:10]

In [29]:
Adf

      Channel        Date Anchor  Views  Comments
6   WorldNews  2015-01-04  alice  490.0      54.0
8   WorldNews  2015-01-05    bob  231.0      13.0
10  WorldNews  2015-01-06   jenn  399.0      17.0
12  WorldNews  2015-01-07   jenn  463.0      26.0
14  WorldNews  2015-01-08    bob  479.0      27.0

In [30]:
Bdf

         Channel        Date Anchor  Views  Comments
11  WorldWeather  2015-01-06  harry  293.0       9.0
13  WorldWeather  2015-01-07  emily  304.0       6.0
15  WorldWeather  2015-01-08  emily  470.0      10.0
17  WorldWeather  2015-01-09    tom    NaN      15.0
19  WorldWeather  2015-01-10  harry  337.0       4.0

#### 6.1 Concat

This function performs the concatenation operation along a given axis.

*axis=0* means the operation will be performed along the *rows*, and for *axis=1* it will be along columns.

By default, it's acted along *rows*, ie *axis=0*.

In [31]:
pd.concat([Adf, Bdf])

         Channel        Date Anchor  Views  Comments
6      WorldNews  2015-01-04  alice  490.0      54.0
8      WorldNews  2015-01-05    bob  231.0      13.0
10     WorldNews  2015-01-06   jenn  399.0      17.0
12     WorldNews  2015-01-07   jenn  463.0      26.0
14     WorldNews  2015-01-08    bob  479.0      27.0
11  WorldWeather  2015-01-06  harry  293.0       9.0
13  WorldWeather  2015-01-07  emily  304.0       6.0
15  WorldWeather  2015-01-08  emily  470.0      10.0
17  WorldWeather  2015-01-09    tom    NaN      15.0
19  WorldWeather  2015-01-10  harry  337.0       4.0

In [32]:
pd.concat([Adf, Bdf], axis=1)

,Channel,Date,Anchor,Views,Comments,Channel,Date,Anchor,Views,Comments
6,WorldNews,2015-01-04,alice,490.0,54.0,NaN,NaN,NaN,NaN,NaN
8,WorldNews,2015-01-05,bob,231.0,13.0,NaN,NaN,NaN,NaN,NaN
10,WorldNews,2015-01-06,jenn,399.0,17.0,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,WorldWeather,2015-01-06,harry,293.0,9.0
12,WorldNews,2015-01-07,jenn,463.0,26.0,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,WorldWeather,2015-01-07,emily,304.0,6.0
14,WorldNews,2015-01-08,bob,479.0,27.0,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,NaN,WorldWeather,2015-01-08,emily,470.0,10.0
17,NaN,NaN,NaN,NaN,NaN,WorldWeather,2015-01-09,tom,NaN,15.0
19,NaN,NaN,NaN,NaN,NaN,WorldWeather,2015-01-10,harry,337.0,4.0

#### 6.2 Join

Pandas provides a single function, **merge**, for all standard join operations between DataFrame objects.

We will look the basic arguments for this function.

```python
merge(left, right, how='inner', on=None)
```

* **left** - A DataFrame object
* **right** - Another DataFrame to combine with.
* **how** - Type of join operation, defaults to *inner*. Can be one of *left*, *right*, *inner*, and *outer*.
* **on** - Columns names on which the join operation will be performed. Must be available in both the left and right DataFrame.

##### 6.1 Inner Join

By default, **join** operates like the **inner join** of SQL.

Here, we are performing the join on the 'Date' column.

Uses intersection of keys from both the DataFrames.

We will get 3 rows because in the 'Date' columns there are only three matches.

In [33]:
pd.merge(Adf, Bdf, on='Date')

,Channel_x,Date,Anchor_x,Views_x,Comments_x,Channel_y,Anchor_y,Views_y,Comments_y
0,WorldNews,2015-01-06,jenn,399.0,17.0,WorldWeather,harry,293.0,9.0
1,WorldNews,2015-01-07,jenn,463.0,26.0,WorldWeather,emily,304.0,6.0
2,WorldNews,2015-01-08,bob,479.0,27.0,WorldWeather,emily,470.0,10.0

##### 6.2 Left Outer Join

Uses the keys from left DataFrame only.

```python
how='left'
```

We can see that for the 'Date' values '2015-01-04' and '2015-01-05', there is not any corresponding matches **(NaN)** in the right DataFrame.

Because these rows are not present in the right DataFrame, **Bdf**.

In [34]:
pd.merge(Adf, Bdf, how='left', on='Date')

,Channel_x,Date,Anchor_x,Views_x,Comments_x,Channel_y,Anchor_y,Views_y,Comments_y
0,WorldNews,2015-01-04,alice,490.0,54.0,NaN,NaN,NaN,NaN
1,WorldNews,2015-01-05,bob,231.0,13.0,NaN,NaN,NaN,NaN
2,WorldNews,2015-01-06,jenn,399.0,17.0,WorldWeather,harry,293.0,9.0
3,WorldNews,2015-01-07,jenn,463.0,26.0,WorldWeather,emily,304.0,6.0
4,WorldNews,2015-01-08,bob,479.0,27.0,WorldWeather,emily,470.0,10.0

##### 6.3 Right Outer Join

Uses the keys from right DataFrame only.

```python
how='right'
```

In [35]:
pd.merge(Adf, Bdf, how='right', on='Date')

,Channel_x,Date,Anchor_x,Views_x,Comments_x,Channel_y,Anchor_y,Views_y,Comments_y
0,WorldNews,2015-01-06,jenn,399.0,17.0,WorldWeather,harry,293.0,9.0
1,WorldNews,2015-01-07,jenn,463.0,26.0,WorldWeather,emily,304.0,6.0
2,WorldNews,2015-01-08,bob,479.0,27.0,WorldWeather,emily,470.0,10.0
3,NaN,2015-01-09,NaN,NaN,NaN,WorldWeather,tom,NaN,15.0
4,NaN,2015-01-10,NaN,NaN,NaN,WorldWeather,harry,337.0,4.0

##### 6.3 Full Outer Join

Uses the intersection of keys from both DataFrames.

```python
how='outer'
```

In [36]:
pd.merge(Adf, Bdf, how='outer', on='Date')

,Channel_x,Date,Anchor_x,Views_x,Comments_x,Channel_y,Anchor_y,Views_y,Comments_y
0,WorldNews,2015-01-04,alice,490.0,54.0,NaN,NaN,NaN,NaN
1,WorldNews,2015-01-05,bob,231.0,13.0,NaN,NaN,NaN,NaN
2,WorldNews,2015-01-06,jenn,399.0,17.0,WorldWeather,harry,293.0,9.0
3,WorldNews,2015-01-07,jenn,463.0,26.0,WorldWeather,emily,304.0,6.0
4,WorldNews,2015-01-08,bob,479.0,27.0,WorldWeather,emily,470.0,10.0
5,NaN,2015-01-09,NaN,NaN,NaN,WorldWeather,tom,NaN,15.0
6,NaN,2015-01-10,NaN,NaN,NaN,WorldWeather,harry,337.0,4.0

### 7. Cleaning Data: Dates, Strings, and Formatting

We want our data to be in the cleanest form, so that we can use it further.

For this, we need to get it in the desired structure, that's called cleaning the data.

#### 7.1 Numerical Formatting

Remember the interpolated DataFrame result? You can notice that the resultant values are **Float64** type.

Some of the values are like 11.5, 7.5 etc.

In [37]:
type(worldnews_interpolated_df['Comments'][0])

numpy.float64

As we know that 'Views' or 'Comments' should be a perfect number by definition.

We can format this by applying the **ceil** function on the 'Comments' column.

In [38]:
worldnews_interpolated_df['Comments'] = worldnews_interpolated_df['Comments'].apply(np.ceil)

That will map a number to the smallest integer greater than or equal to it.

#### 7.2 Dates Formatting

We can see that the Series objects in the column 'Date' are 'str' types.

In [39]:
type(worldnews_df['Date'][0])

str

We can use the **to_datetime** function to convert them into 'Timestamp' type.

The 'format' argument can be used to define the format of date in the 'Series', '2015-01-01' matches with '%Y-%m-%d'.

This can be used to timestamp related calculations.

In [48]:
worldnews_df.loc[:, 'Date'] = pd.to_datetime(worldnews_df['Date'], format="%Y-%m-%d")

In [41]:
type(worldnews_df['Date'][0])

pandas.tslib.Timestamp

Pandas also provides functinoality equivalent to "datetime.timedelta", which is called "Timedelta".

In [42]:
time_a = worldnews_df['Date'][0]
time_b = worldnews_df['Date'][2]

time_diff = time_b - time_a
type(time_diff)

pandas.tslib.Timedelta

We can collect different components of "Timedelta" object like "days", "hours", "minutes" etc.

In [43]:
time_diff.components

Components(days=1, hours=0, minutes=0, seconds=0, milliseconds=0, microseconds=0, nanoseconds=0)

#### 7.3 String Formatting

Pandas provide you a lot of [string formatting](http://pandas.pydata.org/pandas-docs/stable/api.html#string-handling) methods.

You can count the occurence of a particular pattern in a column.

In [44]:
worldnews_df['Anchor'].str.count('jenn').sum()

57

Using the **unique** method you can check that different values in a column.

You can observe that the name of 'Anchor' is in smallcase.

In [45]:
worldnews_df['Anchor'].unique()

array(['bob', 'alice', 'jenn'], dtype=object)

Using the **capitalize** method, we can format the string values. There are other methods such as **upper**, **lower** etc.

In [46]:
worldnews_df['Anchor'].str.capitalize().unique()

array(['Bob', 'Alice', 'Jenn'], dtype=object)

Now suppose that there was a problem in data collection, the name of an anchor was "Matt" instead of "Bob".

We do have a method for this situation too, **replace**. Taking arguments as the "pattern" and "expected replacing string".

In [47]:
worldnews_df['Anchor'].apply(lambda s: s.replace('bob', 'matt')).unique()

array(['matt', 'alice', 'jenn'], dtype=object)